
&НаКлиенте
Процедура Применить(Команда)
	
	НомераКТ.Сортировать("Номер");
	_Строка = "";
	
	Для Каждого Стр Из НомераКТ Цикл
		Если ЗначениеЗаполнено(Стр.Номер) Тогда
			_Строка = _Строка + ?(ЗначениеЗаполнено(_Строка), "; ", "") + Формат(Стр.Номер, "ЧГ=0");
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(_Строка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомераКТ") Тогда
		_МассивНомеров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры.НомераКТ, ";", Истина, Истина);
		
		ОписаниеТипа = Новый ОписаниеТипов("Число");
		
		Для Каждого Стр Из _МассивНомеров Цикл
			НС = НомераКТ.Добавить();
			НС.Номер = ОписаниеТипа.ПривестиЗначение(Стр);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
