
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДоступныеЛокацииДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_НастройкиВозможностейДобавленияКризисМенеджеров КАК гхб_НастройкиВозможностейДобавленияКризисМенеджеров
	               |ГДЕ
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Сотрудник = &Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	гхб_НастройкиВозможностейДобавленияКризисМенеджеров.Локация";
	
	Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли