
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УИДСинхронизации.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
	
	ЗаполнитьСвойстваПомещения();
	ЮридическиеЛицаВПомещениях.Параметры.УстановитьЗначениеПараметра("Помещение", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПомещения()
	
	_СвойстваПомещения = Справочники.гхб_Помещения.ВернутьДанныеПомещения(Объект.Ссылка, Ложь);
	
	Локация = _СвойстваПомещения.Локация;
	Корпус = _СвойстваПомещения.Корпус;
	ЭлементСтроения = _СвойстваПомещения.ЭлементСтроения;
	Закрыть = _СвойстваПомещения.Закрыть;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	НомерПомещения = _СвойстваПомещения.НомерПомещения;
	ДробнаяЧасть = _СвойстваПомещения.ДробнаяЧасть;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	Площадь = _СвойстваПомещения.Площадь;
	НомерНаГенеральномПлане = _СвойстваПомещения.НомерНаГенеральномПлане;
	ПлановоеКоличествоРабочихМест = _СвойстваПомещения.ПлановоеКоличествоРабочихМест;
	НетРабочихМест = _СвойстваПомещения.НетРабочихМест;
	УточняющаяИнформация = _СвойстваПомещения.УточняющаяИнформация;
	ДоступВПомещениеПоКлючу = _СвойстваПомещения.ДоступВПомещениеПоКлючу;
	НаличиеОхраннойСигнализации = _СвойстваПомещения.НаличиеОхраннойСигнализации;
	ВнутреннийНомерКТ = _СвойстваПомещения.ВнутреннийНомерКТ;
	НаличиеКТ = _СвойстваПомещения.НаличиеКТ;
	СогласованиеДоступаСВысшимРуководителем = _СвойстваПомещения.СогласованиеДоступаСВысшимРуководителем;
	ОбщегоПользования = _СвойстваПомещения.ОбщегоПользования;
	
	ДополнительнаяИнформация = РегистрыСведений.гхб_ДополнительныеСвойстваПомещений.ВернутьДополнительнуюИнформациюДляПомещения(Объект.Ссылка);
	
	ОтветственныйЗаПомещение = РегистрыСведений.гхб_ОтветственныеЗаПомещения.ВернутьОтветственногоДляПомещения(Объект.Ссылка);
	
	_Данные = РегистрыСведений.гхб_РаспределениеДоступовВПомещения.ВернутьДанныеПоПомещению(Объект.Ссылка);
	ЮридическоеЛицоСобственник = _Данные.ЮридическоеЛицоСобственник;
	ЮридическоеЛицоРаспорядитель = _Данные.ЮридическоеЛицоРаспорядитель;
	ДивизионРаспорядитель = _Данные.ДивизионРаспорядитель;
	ДепартаментРаспорядитель = _Данные.ДепартаментРаспорядитель;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещение(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Помещение", Объект.Ссылка);
	_Параметры.Вставить("ТипПомещения", ТипПомещения);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьПомещениеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_СвойстваПомещений.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьСвойстваПомещения();
	Элементы.ЮридическиеЛицаВПомещениях.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
