#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "гхб_ОрганизацииБазХолдинга";
	ВидДоступа.Представление = НСтр("ru = 'Организации баз холдинга'");
	ВидДоступа.ТипЗначений  = Тип("СправочникСсылка.гхб_ОрганизацииБазХолдинга");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "гхб_БазыХолдинга";
	ВидДоступа.Представление = НСтр("ru = 'Базы холдинга'");
	ВидДоступа.ТипЗначений  = Тип("СправочникСсылка.гхб_БазыХолдинга");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "гхб_Дивизионы";
	ВидДоступа.Представление = НСтр("ru = 'Дивизионы'");
	ВидДоступа.ТипЗначений  = Тип("СправочникСсылка.гхб_Дивизионы");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыКонтактнойИнформации";
	ВидДоступа.Представление = НСтр("ru = 'Виды контактной информации'");
	ВидДоступа.ТипЗначений  = Тип("СправочникСсылка.ВидыКонтактнойИнформации");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//Списки.Вставить(Метаданные.Справочники._ДемоБанковскиеСчета, Истина);
	//Списки.Вставить(Метаданные.РегистрыСведений.гхб_КонтактнаяИнформацияБазХолдинга, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти