
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		гхб_ОбщегоНазначенияСервер.СообщитьОЗапретеСозданияЭлементаСправочника(Отказ);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.ДекорацияДатаРождения.Видимость = ЗначениеЗаполнено(Объект.ДатаРождения);
	Если Элементы.ДекорацияДатаРождения.Видимость Тогда
		Элементы.ДекорацияДатаРождения.Заголовок = "Дата рождения(число, месяц): " + Формат(Объект.ДатаРождения, "ДФ='dd MMMM'")
	КонецЕсли;
	
	Элементы.ДатаРождения.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	Элементы.РасчетныйСчетДляВыплат.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	Элементы.СКР_ДляВыплатНаБанк.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	
КонецПроцедуры

#КонецОбласти



