
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьСписокДоступныхЛокацийДляТекущегоПользователя() Экспорт
	
	_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
	_Администратор = ТекущийПользовательИмеетПолныеПраваДляЗакрепленияПомещенияЗаСотрудниками();
	
	Если _Администратор Тогда
		_МассивЛокаций = Справочники.гхб_Помещения.ВернутьАктивныеПомещенияПоТипу(Справочники.гхб_ТипыПомещений.Локация);
	Иначе
		_МассивЛокаций = РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(_ФЛ);
		
		_МассивЛокацийОтветственные = РегистрыСведений.гхб_ОтветственныеЗаЛокации.ВернутьЛокацииПоОтветственному(_ФЛ);
		
		Для Каждого _Локация Из _МассивЛокацийОтветственные Цикл
			Если _МассивЛокаций.Найти(_Локация) = Неопределено Тогда
				_МассивЛокаций.Добавить(_Локация);
			КонецЕсли;
		КонецЦикла;
		
		_МассивДополнительный = РегистрыСведений.гхб_ДополнительныеОтветственныеЗаЛокации.ВернутьЛокацииПоДополнительномуОтветственному(_ФЛ);
		
		Для Каждого _Локация Из _МассивДополнительный Цикл
			Если (_МассивЛокаций.Найти(_Локация) = Неопределено) Тогда
				_МассивЛокаций.Добавить(_Локация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат _МассивЛокаций;
	
КонецФункции

Функция ТекущийПользовательИмеетПолныеПраваДляЗакрепленияПомещенияЗаСотрудниками() Экспорт
	
	_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
	
	_Администратор = РольДоступна(Метаданные.Роли.ПолныеПрава) 
		ИЛИ (_ФЛ = Справочники.гхб_СлужебныеЗначения.РуководительОтделаСервисДеск.Значение);
		
	Если НЕ _Администратор Тогда
		
		_Массив = РегистрыСведений.гхб_СотрудникиСАдминистративнымиПравамиЗакреплениеЗаПомещением.ВернутьСотрудниковСАдминистративнымиПравамиЗакреплениеЗаПомещением();
		
		_Администратор = НЕ (_Массив.Найти(_ФЛ) = Неопределено);
		
	КонецЕсли;
	
	Возврат _Администратор;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли