
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьСотрудниковСАдминистративнымиПравамиПожарнаяБезопасность() Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_СотрудникиСАдминистративнымиПравамиПБ.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.гхб_СотрудникиСАдминистративнымиПравамиПБ КАК гхб_СотрудникиСАдминистративнымиПравамиПБ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли