
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура записывает данные об обменах данных с базами холдинга
// Здесь хранится история выгрузки данных из ГХБ 2.0 в учетные базы
Процедура ЗаписатьДанныеВРегистр(ТаблицаЗагрузки) Экспорт

	Для каждого СтрокаЗагрузки Из ТаблицаЗагрузки Цикл
		ЗаписатьСтрокуВРегистр(СтрокаЗагрузки);	
	КонецЦикла;	

КонецПроцедуры

// Запись данных в регистр сведений по строке-ключу
//
// Параметры:
//  СтрокаЗаписи - Структура свойств для записи в регистр 
//
Процедура ЗаписатьСтрокуВРегистр(СтрокаЗаписи) Экспорт

	МенеджерЗаписи = РегистрыСведений.гхб_ИсторияОбменовСБазамиХолдинга.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаЗаписи);
	МенеджерЗаписи.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли