
&НаКлиенте
Процедура ПоказыватьЗакрытые(Команда)
	
	Элементы.СписокПоказыватьЗакрытые.Пометка = НЕ Элементы.СписокПоказыватьЗакрытые.Пометка;
	
	Если Элементы.СписокПоказыватьЗакрытые.Пометка Тогда
		УстановитьОтборПоЗакрытым("Закрыть", Ложь);
	Иначе
		УстановитьОтборПоЗакрытым("Закрыть", Истина, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗакрытым(_ИмяПоля, _Использование, _ВидСравнения = Неопределено, _Значение = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, _ИмяПоля, _Значение, _ВидСравнения, , _Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоЗакрытым("Закрыть", Истина, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УсловиеКонсервации = "";
	
	Если Параметры.Свойство("КонсервацияПомещений") Тогда
		
		_УсловиеКонсервации = " И " + ?(Параметры.КонсервацияПомещений, "", "НЕ ") + "гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ИспользоватьДляКонсервацииПомещений"
		
	КонецЕсли;
	
	Если Параметры.Свойство("ФильтрПоПомещениям") Тогда
		
		Список.ТекстЗапроса = Список.ТекстЗапроса + "
			|	ГДЕ
			|		Справочникгхб_Помещения.Ссылка В ИЕРАРХИИ (&СписокЛокаций)
			|		И НЕ Справочникгхб_Помещения.ЭтоГруппа
			|		И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
			|		" + _УсловиеКонсервации;
		
		Список.Параметры.УстановитьЗначениеПараметра("СписокЛокаций", Параметры.ФильтрПоПомещениям);
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;
	
КонецПроцедуры
