
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Если (_СписокЛокацийДляРедактирования.Количество() = 0) Тогда
		Отказ = Истина;
	Иначе
		ТД = Элементы.Список.ТекущиеДанные;
		
		Если НЕ (ТД = Неопределено) Тогда
			Отказ = (_СписокЛокацийДляРедактирования.НайтиПоЗначению(ТД.Локация) = Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_Массив = Справочники.гхб_Помещения.ВернутьАктивныеПомещенияПоТипу(Справочники.гхб_ТипыПомещений.Локация);
	Иначе
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		
		_Массив = РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(_ФЛ);
	КонецЕсли;
	
	_СписокЛокацийДляРедактирования.ЗагрузитьЗначения(_Массив);
	
КонецПроцедуры
