
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоПомещению(_Помещение) Экспорт 
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Помещение) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Помещение КАК Помещение,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Площадь КАК Площадь,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.УточняющаяИнформация КАК УточняющаяИнформация,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Дивизион КАК Дивизион,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Департамент КАК Департамент
		               |ИЗ
		               |	РегистрСведений.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.СрезПоследних(, Помещение = &Помещение) КАК гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних
		               |ГДЕ
		               |	НЕ гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Закрыть";
		
		Запрос.УстановитьПараметр("Помещение", _Помещение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			_Структура = Новый Структура();
			_Структура.Вставить("Помещение", Выборка.Помещение);
			_Структура.Вставить("ЮридическоеЛицо", Выборка.ЮридическоеЛицо);
			_Структура.Вставить("Площадь", Выборка.Площадь);
			_Структура.Вставить("УточняющаяИнформация", Выборка.УточняющаяИнформация);
			_Структура.Вставить("Дивизион", Выборка.Дивизион);
			_Структура.Вставить("Департамент", Выборка.Департамент);
				
			_Массив.Добавить(_Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли