
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоГруппеПомещений(_ГруппаПомещений) Экспорт 
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_ГруппаПомещений) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_СоставГруппПомещенийСрезПоследних.Помещение КАК Помещение
		               |ИЗ
		               |	РегистрСведений.гхб_СоставГруппПомещений.СрезПоследних(, ГруппаПомещений = &ГруппаПомещений) КАК гхб_СоставГруппПомещенийСрезПоследних
		               |ГДЕ
		               |	НЕ гхб_СоставГруппПомещенийСрезПоследних.Закрыть";
		
		Запрос.УстановитьПараметр("ГруппаПомещений", _ГруппаПомещений);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			_Структура = Новый Структура();
			_Структура.Вставить("Помещение", Выборка.Помещение);
				
			_Массив.Добавить(_Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли