
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоПомещению(_Помещение) Экспорт 
	
	_Структура = Новый Структура();
	_Структура.Вставить("Помещение", );
	_Структура.Вставить("ЮридическоеЛицоСобственник", Справочники.гхб_ОрганизацииБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ЮридическоеЛицоРаспорядитель", Справочники.гхб_ОрганизацииБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ДивизионРаспорядитель", Справочники.гхб_Дивизионы.ПустаяСсылка());
	_Структура.Вставить("ДепартаментРаспорядитель", Справочники.гхб_ПодразделенияОрганизацийБазХолдинга.ПустаяСсылка());
	_Структура.Вставить("ЮридическиеЛицаВПомещении", "");
	_Структура.Вставить("ДивизионыВПомещении", "");
	_Структура.Вставить("ДепартаментыВПомещении", "");
	
	Если ЗначениеЗаполнено(_Помещение) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.Помещение КАК Помещение,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическоеЛицоСобственник КАК ЮридическоеЛицоСобственник,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическоеЛицоРаспорядитель КАК ЮридическоеЛицоРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДивизионРаспорядитель КАК ДивизионРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДепартаментРаспорядитель КАК ДепартаментРаспорядитель,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ЮридическиеЛицаВПомещении КАК ЮридическиеЛицаВПомещении,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДивизионыВПомещении КАК ДивизионыВПомещении,
		               |	гхб_РаспределениеДоступовВПомещенияСрезПоследних.ДепартаментыВПомещении КАК ДепартаментыВПомещении
		               |ИЗ
		               |	РегистрСведений.гхб_РаспределениеДоступовВПомещения.СрезПоследних(, Помещение = &Помещение) КАК гхб_РаспределениеДоступовВПомещенияСрезПоследних";
		
		Запрос.УстановитьПараметр("Помещение", _Помещение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(_Структура, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Структура;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли