
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("ВопросЗагрузитьДанныеЗавершение", ЭтотОбъект);
	
	_ТекстВопроса = НСтр("ru='Загрузить данные по пропускам?';" + 
			"uk='Завантажити дані перепусток?'");
	
	_ТекстЗаголовок = НСтр("ru='Загрузить пропуска?';uk='Завантажити перепустки?'");
	
	ПоказатьВопрос(_ОписаниеОповещения, _ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, _ТекстЗаголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗагрузитьДанныеЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда 
		ЗагрузитьДанныеПропусковСервер();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьДанныеПропусковСервер()
	
	РегистрыСведений.гхб_ИсторияВыдачиПостоянныхПропусков.ЗагрузитьДанныеПропусков();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаЗагрузитьДанные.Доступность = РольДоступна(Метаданные.Роли.ПолныеПрава);
	
КонецПроцедуры
