
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_Массив = Справочники.гхб_Помещения.ВернутьАктивныеПомещенияПоТипу(Справочники.гхб_ТипыПомещений.Локация);
	Иначе
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		
		_Массив = РегистрыСведений.гхб_НастройкиВозможностейДобавленияКризисМенеджеров.ВернутьДоступныеЛокацииДляСотрудника(_ФЛ);
	КонецЕсли;
	
	Если (_Массив.Количество() = 0) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Запись.Локация) И _Массив.Найти(Запись.Локация) = Неопределено Тогда 
		ЭтотОбъект.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Локация.СписокВыбора.ЗагрузитьЗначения(_Массив);
		Элементы.Локация.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры
