
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		_Массив = РегистрыСведений.гхб_НастройкиВозможностиРедактированияПарковочныеМеста.ВернутьДоступныеТипыАвтомобилейДляСотрудника(_ФЛ);
		
		Если ЗначениеЗаполнено(Объект.Ссылка) И (_Массив.Найти(Объект.ТипАвтомобиля) = Неопределено) Тогда
			ЭтотОбъект.ТолькоПросмотр = Истина;
		Иначе 	
			Элементы.ТипАвтомобиля.СписокВыбора.ЗагрузитьЗначения(_Массив);
			Элементы.ТипАвтомобиля.РежимВыбораИзСписка = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ГосударственныйНомер) Тогда
		_АвтомобильСТакимЖеНомером = 
			ПроверитьСуществованиеАвтомобиляПоГосударственномуНомеру(Объект.ГосударственныйНомер, Объект.Ссылка);
			
		Если ЗначениеЗаполнено(_АвтомобильСТакимЖеНомером) Тогда
			Отказ = Истина;
			
			_ТекстСообщения = НСтр("ru='Указанный гос.номер используется в другом автомобиле: " +  
				"';uk='Вказаний держ.номер використовується в іншому автомобілі: '") + СокрЛП(_АвтомобильСТакимЖеНомером);
			
			Сообщить(_ТекстСообщения, СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеАвтомобиляПоГосударственномуНомеру(_ГосударственныйНомер, _АвтомобильИскючение)
	
	Возврат Справочники.гхб_Автомобили.ВернутьАвтомобильПоГосударственномуНомеру(_ГосударственныйНомер, _АвтомобильИскючение);
	
КонецФункции
