
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает массив доступных локаций, для которых документом "гхб_СвойстваПомещений" установлен признак использования для парковок
// Параметры:
//		Нет параметров
//
Функция ВернутьДоступныеЛокацииДляПарковок() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.СрезПоследних КАК гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |		ПО гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.Локация = гхб_СвойстваПомещенийСрезПоследних.Помещение
	               |ГДЕ
	               |	гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.ИспользоватьДляЗакрепленияПарковочныхМест
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли