
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьСотрудниковСАдминистративнымиПравамиЗакреплениеЗаПомещением() Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_СотрудникиСАдминистративнымиПравамиЗакреплениеЗаПомещением.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.гхб_СотрудникиСАдминистративнымиПравамиЗакреплениеЗаПомещением КАК гхб_СотрудникиСАдминистративнымиПравамиЗакреплениеЗаПомещением";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли