
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_Список = ЭтаФорма.Параметры._Список;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура _СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Применить(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	_СП = Новый СписокЗначений();
	
	Для Каждого _С Из Элементы._Список.ВыделенныеСтроки Цикл
		_СП.Добавить(_Список.Получить(_С).Значение);
	КонецЦикла;
	
	Закрыть(_СП);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

#КонецОбласти
