
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанныеСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "", _Комментарий = "", _ДатаСобытия = Неопределено) Экспорт 
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = _СсылкаНаОбъект;
		Запись.ТипСобытия = _ТипСобытия;
		Запись.КлючСтроки = _КлючСтроки;
		Запись.ДатаСобытия = ?(_ДатаСобытия = Неопределено, гхб_ОбщегоНазначенияСервер.ВернутьВремяНаСервере(), _ДатаСобытия);
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Комментарий = _Комментарий;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		Запись.ДатаСобытия = ?(_ДатаСобытия = Неопределено, гхб_ОбщегоНазначенияСервер.ВернутьВремяНаСервере(), _ДатаСобытия);
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Комментарий = _Комментарий;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьДанныеСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт 
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);

	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СобытиеПоОбъектуБыло(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() <> 0;
	
КонецФункции

Функция ВернутьДатуСобытияОбъекта(_СсылкаНаОбъект, _ТипСобытия, _КлючСтроки = "") Экспорт
	
	НаборЗаписей = РегистрыСведений.гхб_СобытияОбъектовБД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(_СсылкаНаОбъект);
	НаборЗаписей.Отбор.ТипСобытия.Установить(_ТипСобытия);
	НаборЗаписей.Отбор.КлючСтроки.Установить(_КлючСтроки);
	
	НаборЗаписей.Прочитать();
	
	Возврат ?(НаборЗаписей.Количество() <> 0, НаборЗаписей[0].ДатаСобытия, Дата(1, 1, 1));
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли