
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПользНастройкаДата1 = ПользовательскаяНастройкаПараметра("ДатаНачала", КомпоновщикНастроек);
	ПользНастройкаДата2 = ПользовательскаяНастройкаПараметра("ДатаОкончания", КомпоновщикНастроек);
	
		//Запрос = Новый Запрос();
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	_Даты.Дата КАК Дата,
		//               |	_Даты.ДатаСтрокаЗаголовка КАК ДатаСтрокаЗаголовка,
		//               |	_Даты.СтатусКонсервации КАК СтатусКонсервации,
		//               |	_Даты.Помещение КАК Помещение
		//               |ПОМЕСТИТЬ _Помещения
		//               |ИЗ
		//               |	&ТЗПериоды КАК _Даты
		//               |
		//               |ИНДЕКСИРОВАТЬ ПО
		//               |	Дата
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	НАЧАЛОПЕРИОДА(гхб_АктуальныеДокументыКонсервацииПомещений.Дата, НЕДЕЛЯ) КАК Дата,
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Помещение КАК Помещение,
		//               |	МАКСИМУМ(гхб_АктуальныеДокументыКонсервацииПомещений.ДокументКонсервации.СтатусКонсервации) КАК ДокументКонсервацииСтатусКонсервации
		//               |ПОМЕСТИТЬ _Периоды
		//               |ИЗ
		//               |	РегистрСведений.гхб_АктуальныеДокументыКонсервацииПомещений КАК гхб_АктуальныеДокументыКонсервацииПомещений
		//               |ГДЕ
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	НАЧАЛОПЕРИОДА(гхб_АктуальныеДокументыКонсервацииПомещений.Дата, НЕДЕЛЯ),
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Помещение
		//               |
		//               |ИНДЕКСИРОВАТЬ ПО
		//               |	Помещение
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	ЕСТЬNULL(_Периоды.Дата, _Помещения.Дата) КАК Дата,
		//			   |	_Помещения.ДатаСтрокаЗаголовка КАК ДатаСтрокаЗаголовка,
		//               |	_Помещения.Помещение КАК Помещение,
		//               |	ЕСТЬNULL(_Периоды.ДокументКонсервацииСтатусКонсервации, _Помещения.СтатусКонсервации) КАК ДокументКонсервацииСтатусКонсервации
		//               |ИЗ
		//               |	_Помещения КАК _Помещения
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ _Периоды КАК _Периоды
		//               |		ПО _Помещения.Помещение = _Периоды.Помещение И _Помещения.Дата = _Периоды.Дата
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |УНИЧТОЖИТЬ _Периоды
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |УНИЧТОЖИТЬ _Помещения";
		
		Дата1 = НачалоНедели(ПользНастройкаДата1.Значение);
		Дата2 = НачалоДня(КонецНедели(ПользНастройкаДата2.Значение));
		
		ЗапросПомещения = Новый Запрос();
		ЗапросПомещения.Текст = "ВЫБРАТЬ
		                        |	гхб_Помещения.Ссылка КАК Помещение
		                        |ИЗ
		                        |	Справочник.гхб_Помещения КАК гхб_Помещения
		                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
		                        |		ПО гхб_Помещения.Ссылка = гхб_СвойстваПомещенийСрезПоследних.Помещение
		                        |ГДЕ
		                        |	гхб_Помещения.Ссылка В ИЕРАРХИИ(&Помещения)
		                        |	И НЕ гхб_Помещения.ПометкаУдаления
		                        |	И НЕ гхб_Помещения.ЭтоГруппа
		                        |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
		                        |	И гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение
		                        |	И гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ИспользоватьДляКонсервацииПомещений";
		
		ЗапросПомещения.УстановитьПараметр("Помещения", РегистрыСведений.гхб_ОтветственныеЗаКонсервациюПомещений.ВернутьПомещенияДляОтбораПоКонсервацииТекущийПользователь());
		
		//_ТЗПериоды = ВернутьПериодыДляОтчета(Дата1, Дата2, ЗапросПомещения.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение"));
		//
		//Запрос.УстановитьПараметр("ДатаНачала", Дата1);
		//Запрос.УстановитьПараметр("ДатаОкончания", Дата2);
		//Запрос.УстановитьПараметр("ТЗПериоды", _ТЗПериоды);
		
		_ТЗ = РегистрыСведений.гхб_АктуальныеДокументыКонсервацииПомещений.ВернутьСтатусыКонсервацииВПериоде(Дата1, Дата2, ЗапросПомещения.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение"));

		НаборыДанных = Новый Структура();
		НаборыДанных.Вставить("ТЗПериоды", _ТЗ);
	
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
		    
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры

Функция ПользовательскаяНастройкаПараметра(ИмяПараметра, КомпоновщикНастроек)

	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ПараметрПользовательскойНастройки <> Неопределено Тогда
			Возврат ПараметрПользовательскойНастройки;
		Иначе
			Возврат ПараметрДанных;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

#КонецОбласти