
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает массив доступных типов автомобилей для указанного сотрудника
// Параметры:
//		Сотрудник - справочник гхб_ФизическиеЛица
//
Функция ВернутьДоступныеТипыАвтомобилейДляСотрудника(_Сотрудник) Экспорт
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Сотрудник) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.СлужебныеАвтомобили КАК СлужебныеАвтомобили,
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.ПерсональныеАвтомобили КАК ПерсональныеАвтомобили
		               |ИЗ
		               |	РегистрСведений.гхб_НастройкиВозможностиРедактированияПарковочныеМеста КАК гхб_НастройкиВозможностиРедактированияПарковочныеМеста
		               |ГДЕ
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.ПерсональныеАвтомобили Тогда
				_Массив.Добавить(Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Персональный);
			КонецЕсли;
			
			Если Выборка.СлужебныеАвтомобили Тогда
				_Массив.Добавить(Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Служебный);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли