
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьУчетныеДанные();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьУчетныеДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Наименование);
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЗаполнитьУчетныеДанные()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.ПерсональныйКабинетТакси КАК ПерсональныйКабинетТакси,
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.Период КАК ДатаОткрытия
	|ПОМЕСТИТЬ втДатыОткрытия
	|ИЗ
	|	РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних(, Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гхб_ВидыОперацийУПКТ.ОткрытиеКабинета)) КАК гхб_ДанныеПерсональныхКабинетовТаксиОткрытие
	|ГДЕ
	|	гхб_ДанныеПерсональныхКабинетовТаксиОткрытие.ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.ПерсональныйКабинетТакси КАК ПерсональныйКабинетТакси,
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.Период КАК ДатаБлокирования
	|ПОМЕСТИТЬ втДатыЗакрытия
	|ИЗ
	|	РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних(, Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.гхб_ВидыОперацийУПКТ.БлокированиеКабинета)) КАК гхб_ДанныеПерсональныхКабинетовТаксиБлокирование
	|ГДЕ
	|	гхб_ДанныеПерсональныхКабинетовТаксиБлокирование.ПерсональныйКабинетТакси = &ПерсональныйКабинетТакси
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Справочникгхб_ПерсональныеКабинетыТакси.Ссылка КАК Ссылка,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Код КАК Код,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Наименование КАК Наименование,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Логин КАК Логин,
	|	Справочникгхб_ПерсональныеКабинетыТакси.СлужбаТакси КАК СлужбаТакси,
	|	Справочникгхб_ПерсональныеКабинетыТакси.Лимит КАК Лимит,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.БазаХолдинга, ЗНАЧЕНИЕ(Справочник.гхб_БазыХолдинга.ПустаяСсылка)) КАК БазаХолдинга,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.гхб_ОрганизацииБазХолдинга.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Сотрудник, ЗНАЧЕНИЕ(Справочник.гхб_СотрудникиБазХолдинга.ПустаяСсылка)) КАК Сотрудник,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Дивизион, ЗНАЧЕНИЕ(Справочник.гхб_Дивизионы.ПустаяСсылка)) КАК Дивизион,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.ЦФО, ЗНАЧЕНИЕ(Справочник.гхб_ЦФО.ПустаяСсылка)) КАК ЦФО,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонСотрудника, """") КАК ТелефонСотрудника,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлСотрудника, """") КАК еМайлСотрудника,
	|	ЕСТЬNULL(гхб_УПКТ.Руководитель, ЗНАЧЕНИЕ(Справочник.гхб_ФизическиеЛица.ПустаяСсылка)) КАК Руководитель,
	|	ЕСТЬNULL(гхб_УПКТ.Финансист, ЗНАЧЕНИЕ(Справочник.гхб_ФизическиеЛица.ПустаяСсылка)) КАК Финансист,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонРуководителя, """") КАК ТелефонРуководителя,
	|	ЕСТЬNULL(гхб_УПКТ.ТелефонФинансиста, """") КАК ТелефонФинансиста,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлРуководителя, """") КАК еМайлРуководителя,
	|	ЕСТЬNULL(гхб_УПКТ.еМайлФинансиста, """") КАК еМайлФинансиста,
	|	ЕСТЬNULL(гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.гхб_ДолжностиОрганизацийБазХолдинга.ПустаяСсылка)) КАК Должность,
	|	ВЫБОР
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован ЕСТЬ NULL
	|			ТОГДА ""Не актуализирован""
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован = ИСТИНА
	|			ТОГДА ""Блокирован""
	|		КОГДА гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Блокирован = ЛОЖЬ
	|			ТОГДА ""Активен""
	|	КОНЕЦ КАК СтатусКабинета,
	|	гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Плательщик КАК Плательщик,
	|	ВЫБОР
	|		КОГДА втДатыОткрытия.ДатаОткрытия ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА втДатыЗакрытия.ДатаБлокирования ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА втДатыЗакрытия.ДатаБлокирования < втДатыОткрытия.ДатаОткрытия
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ втДатыЗакрытия.ДатаБлокирования
	|	КОНЕЦ КАК ДатаБлокирования,
	|	ЕСТЬNULL(втДатыОткрытия.ДатаОткрытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОткрытия,
	|	гхб_УПКТ.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.гхб_ПерсональныеКабинетыТакси КАК Справочникгхб_ПерсональныеКабинетыТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ДанныеПерсональныхКабинетовТакси.СрезПоследних КАК гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гхб_УПКТ КАК гхб_УПКТ
	|			ПО гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.Регистратор = гхб_УПКТ.Ссылка
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = гхб_ДанныеПерсональныхКабинетовТаксиСрезПоследних.ПерсональныйКабинетТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыОткрытия КАК втДатыОткрытия
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = втДатыОткрытия.ПерсональныйКабинетТакси
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДатыЗакрытия КАК втДатыЗакрытия
	|		ПО Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = втДатыЗакрытия.ПерсональныйКабинетТакси
	|ГДЕ
	|	Справочникгхб_ПерсональныеКабинетыТакси.Ссылка = &ПерсональныйКабинетТакси";
	
	Запрос.УстановитьПараметр("ПерсональныйКабинетТакси", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Текст = "Статус кабинета: " + Выборка.СтатусКабинета + Символы.ПС + Символы.ПС;
		
		Если Выборка.СтатусКабинета = "Не актуализирован" Тогда
			Возврат;
		КонецЕсли;
		
		Текст = Текст + "Дата открытия кабинета: " + Формат(Выборка.ДатаОткрытия, "ДФ=dd.MM.yyyy") + Символы.ПС + Символы.ПС;
		
		Если Выборка.СтатусКабинета = "Блокирован" Тогда
			Текст = Текст + "Дата блокирования кабинета: " + Формат(Выборка.ДатаБлокирования, "ДФ=dd.MM.yyyy") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
		Если Выборка.СтатусКабинета = "Блокирован" Тогда
			Текст = Текст + "Кабинет был закреплен за " + Выборка.Сотрудник + Символы.ПС;
		Иначе
			Текст = Текст + "Кабинет закреплен за " + Выборка.Сотрудник + Символы.ПС;
		КонецЕсли;
		
		Текст = Текст + "Должность: " + Выборка.Должность + Символы.ПС;
		Текст = Текст + "База холдинга: " + Выборка.БазаХолдинга + Символы.ПС;
		Текст = Текст + "Организация: " + Выборка.Организация + Символы.ПС;
		Текст = Текст + "Дивизион: " + Выборка.Дивизион + Символы.ПС;
		Текст = Текст + "ЦФО: " + Выборка.ЦФО + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Контактная информация сотрудника " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонСотрудника + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлСотрудника + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Руководитель: " + Выборка.Руководитель + Символы.ПС + Символы.ПС;
		Текст = Текст + "Контактная информация руководителя " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонРуководителя + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлРуководителя + Символы.ПС + Символы.ПС;
		
		Текст = Текст + "Финансист: " + Выборка.Финансист + Символы.ПС + Символы.ПС;
		Текст = Текст + "Контактная информация финансиста " + Символы.ПС;
		Текст = Текст + "Телефон: " + Выборка.ТелефонФинансиста + Символы.ПС;
		Текст = Текст + "e-mail: " + Выборка.еМайлФинансиста + Символы.ПС;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьУчетныеДанные()

#КонецОбласти
