
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НеЗакрыватьПриВыборе") Тогда
	
		НеЗакрыватьПриВыборе = Параметры.НеЗакрыватьПриВыборе;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НеЗакрыватьПриВыборе Тогда
		
		СтандартнаяОбработка = Ложь;
		
		текДанные = Элементы.Список.ТекущиеДанные;
		стСтрока = ПолучитьДанныеДляСтрокаОтправкиСМС(текДанные.Ссылка);
		
		Если стСтрока.ЕстьДанные Тогда
			
			новСтр = Этаформа.ВладелецФормы.тзПолучатели.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, стСтрока);
		
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных по телефонам физ лица " + Строка(текДанные.Ссылка));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляСтрокаОтправкиСМС(ФизЛицо)
	Возврат гхб_ОбщегоНазначенияСервер.ПолучитьДанныеДляСтрокаОтправкиСМС(ФизЛицо);
КонецФункции // ПолучитьДанныеДляСтрокаОтправкиСМС()

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КадровыеДанные, "ФизЛицоТекущейБазы", Элементы.Список.ТекущаяСтрока, 
		ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
КонецПроцедуры



