
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДоменПоНазванию(_Название) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_Домены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.гхб_Домены КАК гхб_Домены
	               |ГДЕ
	               |	НЕ гхб_Домены.ПометкаУдаления
	               |	И НЕ гхб_Домены.НеИспользовать
	               |	И (гхб_Домены.Наименование = &Наименование
	               |	ИЛИ гхб_Домены.КраткоеНаименование = &Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", _Название);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.гхб_Домены.ПустаяСсылка());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли