
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоАктуальные(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Участники.Параметры.УстановитьЗначениеПараметра("Ссылка", 
		?(Элемент.ТекущаяСтрока = Неопределено, Неопределено, Элемент.ТекущаяСтрока));
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Элементы.УчастникиСогласования.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ТолькоАктуальные(Команда)
	
	Для Каждого ЭлементОтбора Из Участники.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если (ЭлементОтбора.Представление = "_ГруппаИ") Тогда
			ЭлементОтбора.Использование = НЕ Элементы.ТолькоАктуальные.Пометка; 
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТолькоАктуальные.Пометка = НЕ Элементы.ТолькоАктуальные.Пометка;
	
КонецПроцедуры

#КонецОбласти
