
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьОтветственногоЗаЛокацию(_Локация) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.ОтветственныйЗаЛокацию КАК ОтветственныйЗаЛокацию
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаЛокации.СрезПоследних(, Локация = &Локация) КАК гхб_ОтветственныеЗаЛокацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ОтветственныйЗаЛокацию, Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	
КонецФункции

Функция ВернутьЛокацииПоОтветственному(_Ответственный) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаЛокации.СрезПоследних(, ) КАК гхб_ОтветственныеЗаЛокацииСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |		ПО гхб_ОтветственныеЗаЛокацииСрезПоследних.Локация = гхб_СвойстваПомещенийСрезПоследних.Помещение
	               |ГДЕ
	               |	гхб_ОтветственныеЗаЛокацииСрезПоследних.ОтветственныйЗаЛокацию = &ОтветственныйЗаЛокацию
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ОтветственныйЗаЛокацию", _Ответственный);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли