
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	СотрудникиКраткийСостав = "";
	
	_ТЗ = Данные.Выгрузить(, "ФИО");
	_ТЗ.Свернуть("ФИО");
	_ТЗ.Сортировать("ФИО");
	
	Для Каждого Стр Из _ТЗ Цикл
		СотрудникиКраткийСостав = СотрудникиКраткийСостав + ?(ЗначениеЗаполнено(СотрудникиКраткийСостав), "; ", "") +
			ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Стр.ФИО));
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияПоЗакреплениюСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоЗакреплениюСотрудников()
	
	Для Каждого Стр Из Данные Цикл
	
		_Строка = Движения.гхб_ПраваЗаездаНаТерриториюЛокации.Добавить();
		_Строка.Период = Дата;
		_Строка.Регистратор = Ссылка;
		_Строка.Локация = Локация;
		_Строка.ФИО = Стр.ФИО;
		_Строка.Автомобиль = Стр.Автомобиль;
		_Строка.ВидПропуска = Стр.ВидПропуска;
		_Строка.ДатаНачалаДействия = Стр.ДатаНачалаДействия;
		_Строка.ДатаОкончанияДействия = Стр.ДатаОкончанияДействия;
		_Строка.ТипОперации = Стр.ТипОперации;
	
	КонецЦикла;

	Движения.гхб_ПраваЗаездаНаТерриториюЛокации.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли