
&НаКлиенте
Процедура Применить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Домен) Тогда
		Сообщить("Не заполнен домен.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		Сообщить("Не заполнен логин.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("Домен, Логин", Домен, Логин));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Домен = Параметры.Домен;
	Логин = Параметры.Логин;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	
	Логин = СокрЛП(Логин);
	
КонецПроцедуры
