
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПомещения()
	
	_СвойстваПомещения = Справочники.гхб_Помещения.ВернутьДанныеПомещения(Объект.Ссылка, Ложь);
	
	Локация = _СвойстваПомещения.Локация;
	Корпус = _СвойстваПомещения.Корпус;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	Закрыть = _СвойстваПомещения.Закрыть;
	Площадь = _СвойстваПомещения.Площадь;
	Руководитель = _СвойстваПомещения.Руководитель;
	ОтветственныйЗаЛокацию = _СвойстваПомещения.ОтветственныйЗаЛокацию;
	ИспользоватьДляЗакрепленияПарковочныхМест = _СвойстваПомещения.ИспользоватьДляЗакрепленияПарковочныхМест;
	
	Элементы.Локация.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Корпус)
		ИЛИ (ТипПомещения = Справочники.гхб_ТипыПомещений.ЭлементСтроения);
		
	Элементы.ИспользоватьДляЗакрепленияПарковочныхМест.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
		
	Элементы.Корпус.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.ЭлементСтроения);
	
	Элементы.Руководитель.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
	Элементы.Ответственный.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
	
	Элементы.ФормаЗакрепитьОтветственногоЗаЛокацией.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация)
		И (РольДоступна(Метаданные.Роли.ПолныеПрава) 
			ИЛИ НЕ (РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо).Найти(Объект.Ссылка) = Неопределено));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещение(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Помещение", Объект.Ссылка);
	_Параметры.Вставить("ТипПомещения", ТипПомещения);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьПомещениеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_СвойстваПомещений.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЭтотОбъект.Прочитать();
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьОтветственногоЗаЛокацией(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Локация", Объект.Ссылка);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрепитьОтветственногоЗаЛокациейЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_ЗакреплениеОтветственногоЗаЛокацию.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьОтветственногоЗаЛокациейЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	//ЭтотОбъект.Прочитать();
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры
