
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		_Массив = Справочники.гхб_Помещения.ВернутьАктивныеПомещенияПоТипу(Справочники.гхб_ТипыПомещений.Локация);
	Иначе
		_ФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСеанса.ТекущийПользователь, "ФизическоеЛицо");
		
		_МассивЛокацийДляПарковок = РегистрыСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.ВернутьДоступныеЛокацииДляПарковок();
		_МассивДоступныхЛокаций = РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(_ФЛ);
		
		_Массив = Новый Массив();
		
		Для Каждого Стр Из _МассивДоступныхЛокаций Цикл
			Если НЕ (_МассивЛокацийДляПарковок.Найти(Стр) = Неопределено) Тогда
				_Массив.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если (_Массив.Количество() = 0) Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	ИначеЕсли ЗначениеЗаполнено(Запись.Локация) И _Массив.Найти(Запись.Локация) = Неопределено Тогда 
		ЭтотОбъект.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Локация.СписокВыбора.ЗагрузитьЗначения(_Массив);
		Элементы.Локация.СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
КонецПроцедуры
