
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьЛокацииПоРуководителю(_Руководитель = Неопределено) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_РуководителиЛокацийСрезПоследних.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_РуководителиЛокаций.СрезПоследних КАК гхб_РуководителиЛокацийСрезПоследних";
	
	
	Если НЕ (_Руководитель = Неопределено) Тогда
		Запрос.Текст = Запрос.Текст + "
	               |ГДЕ
	               |	гхб_РуководителиЛокацийСрезПоследних.Руководитель = &Руководитель";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Руководитель", _Руководитель);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

Функция ВернутьРуководителяЛокации(_Локация) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_РуководителиЛокацийСрезПоследних.Руководитель КАК Руководитель
	               |ИЗ
	               |	РегистрСведений.гхб_РуководителиЛокаций.СрезПоследних(, Локация = &Локация) КАК гхб_РуководителиЛокацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Руководитель, Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли