
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоставГруппыПомещений.Параметры.УстановитьЗначениеПараметра("ГруппаПомещений", Справочники.гхб_ГруппыПомещений.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьСоставГруппыПомещений", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоставГруппыПомещений()
	
	УстановитьСоставГруппыПомещенийСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоставГруппыПомещенийСервер()
	
	СоставГруппыПомещений.Параметры.УстановитьЗначениеПараметра("ГруппаПомещений", Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппыПомещенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
