
Функция ВернутьЗначениеЭлементаСправочника(_Элемент, _ЗначениеСтрокаНеограничена = Ложь) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гхб_СлужебныеЗначения.Значение КАК Значение,
	|	гхб_СлужебныеЗначения.ЗначениеСтрокаНеограничена КАК ЗначениеСтрокаНеограничена
	|ИЗ
	|	Справочник.гхб_СлужебныеЗначения КАК гхб_СлужебныеЗначения
	|ГДЕ
	|	гхб_СлужебныеЗначения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", _Элемент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), ?(_ЗначениеСтрокаНеограничена, Выборка.ЗначениеСтрокаНеограничена, Выборка.Значение), Неопределено);
	
КонецФункции