
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтотОбъектИсточник = ПараметрыВыполненияКоманды.Источник.ЭтотОбъект;
	СсылкаНаЭлемент = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно прикреплять файлы для несохраненного элемента!");	
		Возврат;
	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ВладелецФайлов", СсылкаНаЭлемент);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("ВладелецФайла", СсылкаНаЭлемент));
	
	ОткрытьФорму("РегистрСведений.гхб_СписокФайлов.Форма.ФормаНабораЗаписей", ПараметрыОткрытия, ЭтотОбъектИсточник);
	
КонецПроцедуры

#КонецОбласти
