
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Для Каждого _Помещение Из ЭтотОбъект.ВыгрузитьКолонку("Помещение") Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(гхб_ОбщегоНазначенияСервер.ВернутьМассивУзловДляРегистрацииОбменаДаннымиСБазамиХолдинга(), _Помещение);
		ПланыОбмена.ЗарегистрироватьИзменения(гхб_ОбщегоНазначенияСервер.ВернутьМассивУзловДляРегистрацииОбменаДаннымиБазаОхраны(), _Помещение);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли