
&НаКлиенте
Процедура ПоказыватьЗакрытые(Команда)
	
	Элементы.СписокПоказыватьЗакрытые.Пометка = НЕ Элементы.СписокПоказыватьЗакрытые.Пометка;
	
	Если Элементы.СписокПоказыватьЗакрытые.Пометка Тогда
		УстановитьОтборПоЗакрытым("Закрыть", Ложь);
	Иначе
		УстановитьОтборПоЗакрытым("Закрыть", Истина, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗакрытым(_ИмяПоля, _Использование, _ВидСравнения = Неопределено, _Значение = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, _ИмяПоля, _Значение, _ВидСравнения, , _Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоЗакрытым("Закрыть", Истина, ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументСвойстваПомещений(Команда)
	
	ОткрытьФорму("Документ.гхб_СвойстваПомещений.ФормаОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
КонецПроцедуры
