
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
		
		ПутьКПубликацииDocuWiki = ПолучитьПутьКПубликацииDocuWiki();
		ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
		СтруктураИмени = СтрЗаменить(ИмяФормы, ".", Символы.ПС);
		
		Если СтрПолучитьСтроку(СтруктураИмени, 1) = "ОбщаяФорма" Тогда
			СтруктураИмениОФ = СтрЗаменить(ПараметрыВыполненияКоманды.Источник.КлючСохраненияПоложенияОкна, "/", Символы.ПС);
			ИмяВDokuWiki = НРег(СтрПолучитьСтроку(СтруктураИмениОФ, 1));
		Иначе
			ИмяВDokuWiki = НРег(СтрПолучитьСтроку(СтруктураИмени, 1) + "." + СтрПолучитьСтроку(СтруктураИмени, 2));
		КонецЕсли;
	
		ЗапуститьПриложение(ПутьКПубликацииDocuWiki + ИмяВDokuWiki);
	
	Исключение
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось загрузить страницу DokuWiki по причине: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПутьКПубликацииDocuWiki()
	
	СлужебноеЗначение = ПредопределенноеЗначение("Справочник.гхб_СлужебныеЗначения.ПутьКПубликацииDocuWiki");
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СлужебноеЗначение, "Значение");
	
КонецФункции

#КонецОбласти
