
#Область ПрограммныйИнтерфейс

Функция ПроверитьАктивностьЛогина(_Домен, _Логин = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(_Домен) ИЛИ НЕ ЗначениеЗаполнено(_Логин) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Connection = ПолучитьCOMОбъект("","ADODB.Connection");
		Connection.Provider = "ADSDSOObject";
		Connection.Open("Active Directory Provider");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	query = "SELECT ADsPath FROM 'LDAP://" + СформироватьСтрокуДС(_Домен.Наименование) + "' WHERE objectClass='user' and SAMAccountName='" + _Логин + "'";
	
	Отключена = Истина;
	
	rs = Connection.Execute(query);
	
	// Делаю первичное чтение свойства чтобы инициировать объект
	Попытка
		_Переменная = rs.EOF;
	Исключение
		//
	КонецПопытки;
	
	Пока НЕ rs.EOF() Цикл
		obj = ПолучитьCOMОбъект(rs.Fields(0).Value);
		
		Если obj.Class="user" Тогда
			obj.GetInfo();
			
			Отключена = obj.AccountDisabled;
		КонецЕсли;
		
		rs.MoveNext();
	КонецЦикла;
	
	Connection.Close();
	
	Возврат НЕ Отключена;
	
КонецФункции

Функция ВернутьСвободныйЛогин(_Параметры) Экспорт
	
	_Тмп = НРег(гхб_ОбщегоНазначенияКлиентСервер.ПерекодироватьПоПравилуТранслитерации(СокрЛП(_Параметры.Фамилия), , , Ложь));
	
	_Массив = Новый Массив();
	_Массив.Добавить(НРег(гхб_ОбщегоНазначенияКлиентСервер.ПерекодироватьПоПравилуТранслитерации(СокрЛП(_Параметры.Имя), , , Ложь)));
	_Массив.Добавить(НРег(гхб_ОбщегоНазначенияКлиентСервер.ПерекодироватьПоПравилуТранслитерации(СокрЛП(_Параметры.Отчество), , , Ложь)));
	
	_ЛогинАктивен = Истина;
	
	Если _ЛогинАктивен Тогда
		Для Каждого Стр Из _Массив Цикл
			_Тмп = _Тмп + ".";
			
			Для ф = 1 По СтрДлина(Стр) Цикл
				_Тмп = _Тмп + Сред(Стр, ф, 1);
				_ЛогинАктивен = ПроверитьАктивностьЛогина(_Параметры.Домен, _Тмп);
				
				Если НЕ _ЛогинАктивен Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ _ЛогинАктивен Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(_ЛогинАктивен, "", _Тмп);
	
КонецФункции

Функция ВернутьПочтуПоЛогину(_Домен, _Логин = "") Экспорт 
	
	Попытка
		Connection = ПолучитьCOMОбъект("","ADODB.Connection");
		Connection.Provider = "ADSDSOObject";
		Connection.Open("Active Directory Provider");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	query = "SELECT ADsPath FROM 'LDAP://" + СформироватьСтрокуДС(_Домен.Наименование) + "' WHERE objectClass='user' and SAMAccountName='" + _Логин + "'";
	
	Отключена = Истина;
	
	rs = Connection.Execute(query);
	
	// Делаю первичное чтение свойства чтобы инициировать объект
	Попытка
		_Переменная = rs.EOF;
	Исключение
		//
	КонецПопытки;
	
	_Почта = "";
	
	Пока НЕ rs.EOF() Цикл
		obj = ПолучитьCOMОбъект(rs.Fields(0).Value);
		
		Если obj.Class="user" Тогда
			obj.GetInfo();
			
			_Почта = obj.mail;
			
			Если ЗначениеЗаполнено(_Почта) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		rs.MoveNext();
	КонецЦикла;
	
	Connection.Close();
	
	Возврат _Почта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСтрокуДС(Домен)
	
	_МассивДомен = гхб_ОбщегоНазначенияКлиентСервер.ВернутьМассивСтрокИзСтроки(Домен, ".");
	_СтрокаДС = "";
	
	Для Каждого Стр Из _МассивДомен Цикл
		_СтрокаДС = _СтрокаДС + ?(ЗначениеЗаполнено(_СтрокаДС), ", ", "") + "DC=" + Стр;
	КонецЦикла;
	
	Возврат Домен + "/" + _СтрокаДС;
	
КонецФункции

#КонецОбласти