
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФильтрПоТипуАвтомобиля") И ЗначениеЗаполнено(Параметры.ФильтрПоТипуАвтомобиля) Тогда
		
		Список.ТекстЗапроса = Список.ТекстЗапроса + "
			|	ГДЕ
			|		НЕ Справочникгхб_Автомобили.ЭтоГруппа
			|		И НЕ Справочникгхб_Автомобили.ПометкаУдаления
			|		И Справочникгхб_Автомобили.ТипАвтомобиля = &ТипАвтомобиля";
		
		Список.Параметры.УстановитьЗначениеПараметра("ТипАвтомобиля", Параметры.ФильтрПоТипуАвтомобиля);
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
	КонецЕсли;
	
КонецПроцедуры
