
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДополнительногоОтветственногоЗаЛокацию(_Локация) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ДополнительныеОтветственныеЗаЛокации.ОтветственныйЗаЛокацию КАК ОтветственныйЗаЛокацию
	               |ИЗ
	               |	РегистрСведений.гхб_ДополнительныеОтветственныеЗаЛокации КАК гхб_ДополнительныеОтветственныеЗаЛокации
	               |ГДЕ
	               |	гхб_ДополнительныеОтветственныеЗаЛокации.Локация = &Локация";
	
	Запрос.УстановитьПараметр("Локация", _Локация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ОтветственныйЗаЛокацию, Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	
КонецФункции

Функция ВернутьЛокацииПоДополнительномуОтветственному(_Ответственный) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ДополнительныеОтветственныеЗаЛокации.Локация КАК Локация
	               |ИЗ
	               |	РегистрСведений.гхб_ДополнительныеОтветственныеЗаЛокации КАК гхб_ДополнительныеОтветственныеЗаЛокации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |		ПО гхб_ДополнительныеОтветственныеЗаЛокации.Локация = гхб_СвойстваПомещенийСрезПоследних.Помещение
	               |ГДЕ
	               |	гхб_ДополнительныеОтветственныеЗаЛокации.ОтветственныйЗаЛокацию = &ОтветственныйЗаЛокацию
	               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ОтветственныйЗаЛокацию", _Ответственный);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли