
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
	
		стВозврат = НайтиСуществующийЛогин();
		
		Если стВозврат.ЕстьКабинет Тогда
			ОбщегоНазначения.СообщитьПользователю("В системе уже создан кабинет с Логином " + Логин + " код " + стВозврат.Код,,,, Отказ);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСуществующийЛогин()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гхб_ПерсональныеКабинетыТакси.Ссылка КАК Кабинет,
	|	гхб_ПерсональныеКабинетыТакси.Код КАК Код,
	|	гхб_ПерсональныеКабинетыТакси.Логин КАК Логин
	|ИЗ
	|	Справочник.гхб_ПерсональныеКабинетыТакси КАК гхб_ПерсональныеКабинетыТакси
	|ГДЕ
	|	НЕ гхб_ПерсональныеКабинетыТакси.ПометкаУдаления
	|	И гхб_ПерсональныеКабинетыТакси.Ссылка <> &Ссылка
	|	И гхб_ПерсональныеКабинетыТакси.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЕстьКабинет, Код", Истина, Выборка.Код);
	Иначе
		Возврат Новый Структура("ЕстьКабинет", Ложь);
	КонецЕсли;

КонецФункции

