
//++ a.romanchuk 25.05.2020 #
Функция ВернутьПутьКФотоФизЛица(_Ссылка) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	гхб_СписокФайлов.КаталогСохранения.Значение КАК КаталогСохраненияЗначение,
	               |	гхб_СписокФайлов.ПолноеИмяФайла КАК ПолноеИмяФайла
	               |ИЗ
	               |	РегистрСведений.гхб_СписокФайлов КАК гхб_СписокФайлов
	               |ГДЕ
	               |	гхб_СписокФайлов.ВладелецФайла = &ВладелецФайла
	               |	И гхб_СписокФайлов.ТипДанных = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыДанныхФайлов.ФотоФизЛица)";
	
	Запрос.УстановитьПараметр("ВладелецФайла", _Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.КаталогСохраненияЗначение + Выборка.ПолноеИмяФайла, "");
	
КонецФункции
//-- a.romanchuk 25.05.2020 #