
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Марка = СокрЛП(Марка);
		Модель = СокрЛП(Модель);
		ГосударственныйНомер = ВРег(СокрЛП(ГосударственныйНомер));
		
		Наименование = Марка + " " + ?(ЗначениеЗаполнено(Модель), Модель + " ", "") + ГосударственныйНомер;
		
		Если (ТипАвтомобиля = Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Персональный) И НЕ ПринадлежитЭлементу(Справочники.гхб_Автомобили.Персональные) Тогда
			Родитель = Справочники.гхб_Автомобили.Персональные;
		ИначеЕсли (ТипАвтомобиля = Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Служебный) И НЕ ПринадлежитЭлементу(Справочники.гхб_Автомобили.Служебные) Тогда
			Родитель = Справочники.гхб_Автомобили.Служебные;
		КонецЕсли;
		
		_АвтомобильСТакимЖеНомером = 
			Справочники.гхб_Автомобили.ВернутьАвтомобильПоГосударственномуНомеру(ГосударственныйНомер, Ссылка);
		
		Отказ = ЗначениеЗаполнено(_АвтомобильСТакимЖеНомером);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли