
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение поля "ДополнительнаяИнформация" для переданного помещения
// Параметры:
//		_Помещение - справочник "гхб_Помещения"
//
Функция ВернутьДополнительнуюИнформациюДляПомещения(_Помещение) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ДополнительныеСвойстваПомещений.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	               |ИЗ
	               |	РегистрСведений.гхб_ДополнительныеСвойстваПомещений КАК гхб_ДополнительныеСвойстваПомещений
	               |ГДЕ
	               |	гхб_ДополнительныеСвойстваПомещений.Помещение = &Помещение";
	
	Запрос.УстановитьПараметр("Помещение", _Помещение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДополнительнаяИнформация, "");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли