
&НаКлиенте
Процедура ЗначениеСтрокаНеограниченаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКомандыЗначениеСтрокаНеограниченаНачалоВыбора", ЭтотОбъект);
	
	МассивЗначений = ПолучитьЗначениеНаСервере();
	Если ТипЗнч(МассивЗначений) = Тип("Массив") ИЛИ МассивЗначений = "" Тогда
		ОткрытьФорму("Справочник.гхб_СлужебныеЗначения.Форма.ФормаРаботыСМассивом", 
						Новый Структура("МассивЗначений", МассивЗначений), ЭтаФорма, , , , ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеНаСервере(МассивЗначений)
	Объект.ЗначениеСтрокаНеограничена = ЗначениеВСтрокуВнутр(МассивЗначений);	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеНаСервере()
	
	Попытка
		Возврат ЗначениеИзСтрокиВнутр(Объект.ЗначениеСтрокаНеограничена);	
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура ОбработкаКомандыЗначениеСтрокаНеограниченаНачалоВыбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		МассивЗначений = Новый Массив;
		Разделитель = "";
		ТекПредставление = "";
		
		Для Каждого Элемент Из Результат Цикл
			
			МассивЗначений.Добавить(Элемент.ЗначениеМассива);
			ТекПредставление = ТекПредставление + Разделитель + Строка(Элемент.ЗначениеМассива); 
			Разделитель = ", ";
			
		КонецЦикла;
		
		Объект.Значение = ТекПредставление;
		УстановитьЗначениеНаСервере(МассивЗначений);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

