
&НаКлиенте
Процедура ПоказатьВсеДокументы(Команда)
	
	_Пометка = НЕ Элементы.ФормаПоказатьВсеДокументы.Пометка;
	УстановитьОтборПоПеренесенным(НЕ _Пометка);
	Элементы.ФормаПоказатьВсеДокументы.Пометка = _Пометка;
	Элементы.ПеренесеноИзБазыРесурсов.Видимость = _Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПеренесенным(_Пометка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПеренесеноИзБазыРесурсов", НЕ _Пометка, ВидСравненияКомпоновкиДанных.Равно, , _Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоПеренесенным(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПеренесеноИзБазыРесурсов.Видимость = Ложь;
	
КонецПроцедуры


