
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьКризисМенеджеров() Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_КризисМенеджерыСпискиДоступа.КризисМенеджер КАК КризисМенеджер
	               |ИЗ
	               |	РегистрСведений.гхб_КризисМенеджерыСпискиДоступа КАК гхб_КризисМенеджерыСпискиДоступа";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КризисМенеджер");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли