
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивДопУслуг") Тогда
		
		НомерТелефона = Параметры.НомерТелефона;
		
		Для каждого ЭлементУслуга Из Параметры.МассивДопУслуг Цикл
		 
			НовСтр = ТаблицаДопУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ЭлементУслуга);
		 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаУслугаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаДопУслуг.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Сумма = ВернутьСуммуПоУслуге(ТекДанные.Услуга);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Ок(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НомерТелефона", НомерТелефона);
	ПараметрыЗакрытия.Вставить("ТаблицаДопУслуг", ТаблицаДопУслуг);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьСуммуПоУслуге(Услуга)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Услуга, "Сумма");
КонецФункции

#КонецОбласти