
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьАктуальныхСотрудниковДляПомещения(_Помещение) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.ОтветственныйЗаПожарнуюБезопасность КАК ОтветственныйЗаПожарнуюБезопасность
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаПожарнуюБезопасность.СрезПоследних(, Помещение = &Помещение) КАК гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("Помещение", _Помещение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтветственныйЗаПожарнуюБезопасность");
	
КонецФункции

Функция ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Помещение КАК Помещение
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаПожарнуюБезопасность.СрезПоследних(, ОтветственныйЗаПожарнуюБезопасность = &ОтветственныйЗаПожарнуюБезопасность) КАК гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ОтветственныйЗаПожарнуюБезопасность", _Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли