
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	но_ТипыДокументов.Код
	               |ИЗ
	               |	Справочник.но_ТипыДокументов КАК но_ТипыДокументов
	               |ГДЕ
	               |	но_ТипыДокументов.ТипДокумента = &ТипДокумента
	               |	И но_ТипыДокументов.Ссылка <> &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщить("Для указанного типа документа уже создан элемент с кодом """ + Выборка.Код + """");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли

